import { Component, OnInit } from '@angular/core';

import { AuthService } from '../core/auth.service';

@Component({
    selector: 'xp-home',
    template: `
        <h1>Hello World!</h1>
        <p>
            <strong>DevChallenge</strong> е един от начините, с който в <a href="http://devlabs.bg/" target="_blank">DevLabs</a> експериментираме,
            за да открием нови колеги. Идеята ни е чрез серия от малки предизвикателства в комбинация с ресурси за самообучение да оценим различни твои качества.
        </p>

        <p>Искаме да работим с хора, които са мотивирани да учат и да се развиват колкото нас. Ако искаш да си част от екипа, ще трябва първо да минеш през няколко изпитания.</p>

        <p>Как се случват нещата:</p>

        <ul>
            <li>Регистрираш се и определяш колко време можеш да отделяш дневно през следващите ~2 седмици (минимумът е половин час на ден).</li>
            <li>Получаваш списък със задачи (TODO-та). Към всяко TODO има ресурси за самообучение. Всяко TODO има срок, съобразен времето, което можеш да отделяш на ден (пример: ако можеш да отделяш по 1 час на ден, а TODO-то е оценено на 4 часа от нас, ще имаш срок от 4 дни да го завършиш).</li>
            <li>В края на всяко TODO има малък challenge - отговор на отворен въпрос, микро-проект или кратък въпросник (със затворени въпроси).</li>
        </ul>

        <p>
            Получаваш точки за опитът, който трупаш (Experience Points).
            Те се разпределят по следния начин:
        </p>
        <ul>
            <li>Всяко TODO е планирано да бъде завършено за определен брой часове. Успешно завършено TODO ти носи по 10 точки за всеки час (пример: TODO-то е оценено на 4 часа; успешното му завършване носи 40 точки)</li>
            <li>За всяко завършено на време TODO, получаваш допълнително 2 точки;</li>
            <li>Имаш възможност да получиш бонус точки.</li>
        </ul>

        <p>Крайната цел е да завършиш всички TODO-та и да спечелиш максимален брой Experience Points. Докажи ни, че си мотивиран да се развиваш, да учиш и да твориш, колкото сме и ние!</p>

        <p *ngIf="! authService.isLoggedIn()">
            <button routerLink="/register" class="btn btn-primary btn-lg">
                Регистрирай се
            </button>
            <button routerLink="/login" class="btn btn-link btn-lg">
                ... или влез
            </button>
        </p>
        <p *ngIf="authService.isLoggedIn()">
            <button routerLink="/dashboard" class="btn btn-primary btn-lg">
                Към задачите!
            </button>
        </p>
    `
})
export class HomeComponent implements OnInit {

    constructor(private authService: AuthService) { }

    ngOnInit() {
    }

}
